app/controllers/api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demouser@gmail.com"], ["LIMIT", 1]]
---
  def email
    @user = User.find_by(email: params[:email])