app/controllers/application_controller.rb

  def current_user
    if session[:session_token]
      return @current_user ||= User.find(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "fFZGTPT84qKj2EPKuui6NA"], ["LIMIT", 1]]