app/models/user.rb

  def self.find_by_credentials(email, password)
    user = User.find(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "testuser@gmail.com"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save
---
INSERT INTO "users" ("account_name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dRxTDGmCnizXYCeNfmwLyw"], ["updated_at", "2019-12-10 20:55:31.791055"], ["id", 1]]